In [2]:
import pandas as pd
import numpy as np

create a pandas DataFrame and groupby by first column (Classs)  and find thirt columns  sum

In [6]:
math=pd.DataFrame({"Class":list("AB")*3,
                   "Stu":["Kim","Sam",
                          "Tim","Tom","John","Kate"],
                   "Score":[60,70,np.nan,
                            55,np.nan,80]})
math

  Class   Stu  Score
0     A   Kim   60.0
1     B   Sam   70.0
2     A   Tim    NaN
3     B   Tom   55.0
4     A  John    NaN
5     B  Kate   80.0

In [11]:
math.groupby("Class")[["Score"]].sum()

       Score
Class
A       60.0
B      205.0